a = int(input("Chỉ số tháng trước: "))
b = int(input("Chỉ số tháng này: "))
c = b - a
if 0 <= c <= 50:
    so_tien = c * 1.984
elif 51 <= c <= 100:
    so_tien = 50*1.984 + (c-50)*2.050
elif 101 <= c <= 200:
    so_tien = 50*1.984 + 50*2.050 + (c-100)*2.380
elif 201 <= c <= 300:
    so_tien = 50*1.984 + 50*2.050 + 100*2.380 + (c-200)*2.998
elif 301 <= c <= 400:
    so_tien = 50*1.984 + 50*2.050 + 100*2.380 + 100*2.998 + (c-300)*3.350
else:
    so_tien = 50*1.984 + 50*2.050 + 100*2.380 + 100*2.998 + 100*3.350 + (c-400)*3.460
d = (so_tien + so_tien*0.08) * 1000
print(f"số tiền phải trả là: {d:.0f}")
